app/controllers/customers_controller.rb

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def show
    @customer = Customer.find(params[:id])