app/controllers/products_controller.rb

  def livingroom
    @title ="Living Room"
    @sets = Product.find(:all, :conditions => ["product_id = 1"])
---
SELECT * FROM `products` WHERE (product_id = 1)

  def beedroom
    @title ="Bed Room"
    @sets = Product.find(:all, :conditions => ["product_id = 9"])
---
SELECT * FROM `products` WHERE (product_id = 9)

  def mattress
    @title ="Mattress"
    @king_size = Product.find(:all, :conditions => ["product_id = 15"])
---
SELECT * FROM `products` WHERE (product_id = 15)

  def bathroom
    @title ="Bathroom"
    @sets = Product.find(:all, :conditions => ["product_id = 21"])
---
SELECT * FROM `products` WHERE (product_id = 21)

  def kitchen
    @title ="Kitchen"
    @sets = Product.find(:all, :conditions => ["product_id = 26"])
---
SELECT * FROM `products` WHERE (product_id = 26)

  def office
    @title ="Office"
    @sets = Product.find(:all, :conditions => ["product_id = 32"])
---
SELECT * FROM `products` WHERE (product_id = 32)

  def outdoor
    @title ="Outdoor"
    @sets = Product.find(:all, :conditions => ["product_id = 37"])
---
SELECT * FROM `products` WHERE (product_id = 37)

  def add_to_cart
    #use product instead of furniture..
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)