app/controllers/static_controller.rb

SELECT * FROM `customers`
---
  def customer_report
    # This will return all customers from the customer table
    @data = Customer.all

SELECT * FROM `products` WHERE (id <= 8)
---
  def product_line_report
    #initally coded by John Evans
    @data = Product.find(:all, :conditions=> "id <= 8")

SELECT * FROM `orders` WHERE (order_date >= '2013-12-2')
---
  def osd_report
    @year = params[:osd_date]["(1i)"]
    @month = params[:osd_date]["(2i)"]
    @day = params[:osd_date]["(3i)"]
    #need yyyyy-mm-dd
    @orders = Order.find(:all, :conditions => ['order_date >= ?', "#{@year}-#{@month}-#{@day}"])

SELECT * FROM `customers` WHERE (c_state = 'TX' OR c_state = 'FL' OR c_state = 'HI' OR c_state = 'CA') ORDER BY c_state
---
   def warm_state_report
      #Created by John Evans, edited and fixed by Mark Miller
      @data = Customer.find(:all , :conditions => ['c_state = ? OR c_state = ? OR c_state = ? OR c_state = ?' , 'TX', 'FL', 'HI', 'CA'], :order => :c_state)

SELECT * FROM `products` WHERE (description LIKE '%%')
---
   def search
    @search_term = params[:srch]
    @products = Product.find(:all, :conditions => ['description LIKE ?', "%#{@search_term}%"])

SELECT * FROM `testimonials` WHERE (testimonial_content LIKE '%really%')
---
   def testimonials_search
    @st = params[:search_term]
    @testimonials = Testimonial.find(:all, :conditions => ['testimonial_content LIKE ?', "%#{@st}%"])