app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `address`, `city`, `c_state`, `zipcode`, `c_type`, `encrypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`) VALUES('Please Work', 'pleasework@example.com', 'PGH 541', 'Houston', 'Texas', '77004', 'Sale', '589ef9cfe465592c8c581b73af7c5ff6b660a2aeb56dd83e2ecfb5c8901baf5a', 'fdba51ba333e1706480ca656a53883b824b44737c66cfebfcd3d6538e9dd21b6', '2013-11-30 23:17:31', '2013-11-30 23:17:31', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save